#ifndef basicgf.h
#define basicgf.h
  /******************************************************************
   功能说明：画水平线函数
   参数说明：x0,y0 起始坐标   x1,y1终止坐标  thick 厚度  color 颜色
   无返回值
 *******************************************************************/
extern void linelevel(int x0,int y0,int x1,int y1,int thick,int color);

/**************************************************************/



/***************************************************************
   功能说明：画竖线函数
   参数说明：x0,y0 起始坐标   x1,y1终止坐标  thick 厚度  color 颜色
   无返回值
***************************************************************/
extern void linever(int x0,int y0,int x1,int y1,int thick,int color);


/**********************************************************/


/**********************************************************
Function：		Horizline

Description：	画水平线函数
可以接收超出屏幕范围的数据，只画出在屏幕内部分
因为没有防止整型变量溢出的判断，画超出屏幕的线时应防止输入特大数据

Calls：			Selectpage

Called By：		Line
Bar
Circlefill

Input：			int x					起始点横坐标，从左到右增加，0为最小值（屏幕参考系）
int y					起始点纵坐标，从上到下增加，0为最小值（屏幕参考系）
int width				水平长度，为正向右延伸，为负向左延伸
unsigned char color		颜色数，共有256种

Output：		屏幕上画出水平线

Return：		None
Others：		None
**********************************************************/
extern void Horizline(int x, int y, int width, int  color);


/************************************************************
   功能说明：画水平矩形函数
   参数说明: x0,y0 左上角坐标   x1,y1右下角坐标 color 颜色
************************************************************/
extern void bar(int x0, int y0, int x1, int y1, int color);

/**************************************************************
 功能说明：以(x,y)点为圆心，以radius为半径画圆，没有防止超出屏幕的判断，
 可以将没有超出的部分画出。
 参数说明：x,y为圆点，radius 为半径，color为颜色。
 无返回值：
 **************************************************************/
 extern void circle(int x0,int y0,int radius,int color);

/**************************************************
function:        bow

description:     此函数是专为机器人正面嘴巴的绘制设计，生成一个弧度为pi/6的下圆弧

Input:           x0,y0,r,color;

out:             弧度pi/6的下圆弧
**************************************************************/
extern void bow(int x0,int y0,int r,int color);


/**************************************************************************
      功能说明：画实心圆
      参数说明：x,y为圆心
     无返回值
**************************************************************************/
extern void FillCircle(/*int x, int y, int r, int color*/int xc, int yc, int radius, int color);

extern void eqver_tri(int x, int y, int length, int color);
 //等腰直角三角形，length是直角边长度
   //方向是固定的，入口参数是直角点的坐标



extern void delay0(int time);
#endif